<!-- App.vue – основной компонент страницы -->
<!-- Основной код страницы -->
<template>
  <h3>{{ info }}</h3>
  <p>{{ someInfo }}</p>

  <!-- Можно написать @ или : или v-on: это просто разный вариает записи -->
  <!-- @ — сокращение для v-on: (события) -->
  <!-- : — сокращение для v-bind: (привязка атрибута) -->
  
  <!-- Одно и то же -->
  <button v-on:click=""></button>
  <button @click=""></button>

  <!-- Одно и то же -->
  <img v-bind:src="imgPath">
  <img :src="imgPath">


  <!-- this – это весь объект который находится в data(){} ниже в скрипте а через точку обращение к методам или переменных и меняем эту переменную -->
  <!-- Вместо @click есть @mouseenter - при наведии мышкой  -->
  <button type="button" @click="this.info = 'Этот текст появится при нажатии на кнопку'">Отправить</button>


  <!-- В современном подходе внутри template в Vue this писать не нужно this автоматически доступен в методах и выражениях в шаблоне, Vue сам подставит его под капотом -->
  <button type="button" @click="info = 'Этот текст появится при нажатии кнопки'">Отправить без this</button>
  

  <!-- Второй вариант чтобы не писать код Vue прямо в HTML в () можно так же передавать параментры -->
  <button type="button" @click="userData()">Отправить с вызовом функции userData()</button>
  
</template>



<!-- Подключаются все скрипты -->
<!-- script setup пишется если будет много компонентов. Сейчас будет только 1 поэтому setup не пишем -->
<script>
  // Нужно указать что будет экспортироваться из всего этого файла по умолчанию (некий объект)
  // И этом объекте хранятся разлиные действия для всего этого компонента
  export default {
    // Созадаём переменные которые будем добавлять в основной html
    // Создаются они через вызов функции (стандартная запись) data() { return { ... } }
    data() {
      return {
        info: 'Название странцы', // Переменная с текстом
        someInfo: 'Lorem ipsum dolor sit amet consectetur adipisicing elit. Reprehenderit, quo!' // сколько угодно тут может быть данных, переменные, массивы, объекты и т.д
      }
    },
    // Создаём методы в которых будут функции которые можно будет вызывать чтобы не писать Vue код прямо в HTML
    methods: {
      // Функция userData сами придумали. Можно передавать и принимать параметры
      // Можно поставить параметр по умолчанию например userData(word = 'Новый текст') и если забыл что-то передать в @click="userData()" то word подставится по умолчанию
      userData() {
        this.info = 'Текст который меняет заголовок'
        this.someInfo = 'Это вторая строчка функции, которая будет менять описание при нажатии на кнопку'
      } 
    }
  }
</script>



<!-- Весь CSS для этого компонента -->
<style scoped>
  h3 {
    font-weight: lighter;
  }

  p {
    color: tomato;
  }
</style>
